[
  {
    "title": "Schedule a notification",
    "pageList": [
      {
        "message": "On the main screen, select an app for which you would like to schedule a notification",
        "imageUrl": "img/schedule/0.png"
      },
      {
        "message": "Fill out any details about the notification including message content and time. Click \"Fire Notification\" when you are done.",
        "imageUrl": "img/schedule/1.png"
      },
      {
        "message": "When the scheduled time comes, you will recieve the notification.",
        "imageUrl": "img/schedule/2.png"
      },
      {
        "message": "Tapping the notification will open the app you had previously selected.",
        "imageUrl": "img/schedule/3.png"
      }
    ]
  },
  {
    "title": "Edit an existing scheduled notification",
    "pageList": [
      {
        "message": "On the home screen, tap the menu button. This is located in the bottom right corner of the screen and has a plus symbol on it.",
        "imageUrl": "img/edit/0.png"
      },
      {
        "message": "When a notification has been scheduled, the \"Upcoming Notifications\" option will appear. Tap this option.",
        "imageUrl": "img/edit/1.png"
      },
      {
        "message": "You will be directed to the scheduled notifications page. Pick an item you want to change and tap \"Edit\"",
        "imageUrl": "img/edit/2.png"
      },
      {
        "message": "You will be directed to the notification scheduling page with the existing info pre-populated. Make any changes you want and click \"Reschedule Notification\" to overwrite the existing notification.",
        "imageUrl": "img/edit/3.png"
      }
    ]
  },
  {
    "title": "Create a Quick Notification",
    "pageList": [
      {
        "message": "When scheduling a \"relative\" notification, you'll see an option to \"Create a quick notification option\". Checking this will create a Quick Notication when you schedule the notification.",
        "imageUrl": "img/qn/0.png"
      },
      {
        "message": "Quick notifications will be shown on the main screen in a collapsable header. Clicking a quick notification will schedule a copy of the original notification that you had created.",
        "imageUrl": "img/qn/1.png"
      },
      {
        "message": "On Android 7.1 and above, Quick Notifications will also be shown in the list of app shortcuts. Note that only the 3 most-recent Quick Notifications will show up in the list.",
        "imageUrl": "img/qn/2.png"
      },
      {
        "message": "App shortcuts can also be pinned. If pinned, you can delete the Quick Notification in the app without deleting the pinned item.",
        "imageUrl": "img/qn/3.png"
      }
    ]
  }
]