[
  {
    "title": "Schedule a notification",
    "pageList": [
      {
        "message": "On the main screen, select an app for which you would like to schedule a notification",
        "imageUrl": "tutorials/en/schedule/0.png"
      },
      {
        "message": "Fill out any details about the notification including message content and time. Click \"Fire Notification\" when you are done.",
        "imageUrl": "tutorials/en/schedule/1.png"
      },
      {
        "message": "When the scheduled time comes, you will recieve the notification.",
        "imageUrl": "tutorials/en/schedule/2.png"
      },
      {
        "message": "Tapping the notification will open the app you had previously selected.",
        "imageUrl": "tutorials/en/schedule/3.png"
      }
    ]
  },
  {
    "title": "Edit an existing scheduled notification",
    "pageList": [
      {
        "message": "On the home screen, select the \"Upcoming\" option from the Bottom Navigation Bar.",
        "imageUrl": "tutorials/en/edit/0.png"
      },
      {
        "message": "You will be directed to the scheduled notifications page. Pick an item you want to change and tap \"Edit\"",
        "imageUrl": "tutorials/en/edit/1.png"
      },
      {
        "message": "You will land on the notification scheduling page with the existing info pre-populated. Make any changes you want and click \"Reschedule Notification\" to overwrite the existing notification.",
        "imageUrl": "tutorials/en/edit/2.png"
      }
    ]
  },
  {
    "title": "Create notification from Share action",
    "pageList": [
      {
        "message": "Notifications can be scheduled using content shared from other applications.",
        "imageUrl": "tutorials/en/share/0.png"
      },
      {
        "message": "In another app, find something you would like to share and click the share action within that application.",
        "imageUrl": "tutorials/en/share/1.png"
      },
      {
        "message": "when the share sheet pops up from the bottom, select \"Notification Launcher\".",
        "imageUrl": "tutorials/en/share/2.png"
      },
      {
        "message": "Change any details you would like, such as timing, on the details page, then click \"Fire Notification\".",
        "imageUrl": "tutorials/en/share/3.png"
      },
      {
        "message": "when the time comes, you will get the desired notification. If the notification contains a URL, the app will parse it and take you to the corresponding app.",
        "imageUrl": "tutorials/en/share/4.png"
      },
      {
        "message": " For instance, items shared from the Play Store will open the Play Store app directly to the shared content when the notification is clicked.",
        "imageUrl": "tutorials/en/share/5.png"
      }
    ]
  },
  {
    "title": "Create a Quick Notification",
    "pageList": [
      {
        "message": "When scheduling a \"relative\" notification, you'll see an checkbox to \"Create a quick notification option\". Checking this will create a Quick Notication when you schedule the notification.",
        "imageUrl": "tutorials/en/qn/add/0.png"
      },
      {
        "message": "Quick notifications will be shown on the main screen in a collapsable header. Clicking a quick notification will schedule a copy of the original notification that you had created.",
        "imageUrl": "tutorials/en/qn/add/1.png"
      },
      {
        "message": "On Android 7.1 and above, Quick Notifications will also be shown in the list of app shortcuts. Note that only the 3 most-recent Quick Notifications will show up in the list.",
        "imageUrl": "tutorials/en/qn/add/2.png"
      },
      {
        "message": "App shortcuts can also be pinned. If pinned, you can delete the Quick Notification in the app without deleting the pinned item.",
        "imageUrl": "tutorials/en/qn/add/3.png"
      }
    ]
  },
  {
    "title": "Deleting Quick Notifications",
    "pageList": [
      {
        "message": "If you have created a Quick Notifications, you will see them on the app list screen under the collapsable Quick Notifications section.",
        "imageUrl": "tutorials/en/qn/delete/0.png"
      },
      {
        "message": "Long pressing the Quick Notification that you want to delete will remove it. A message at the bottom of the screen will allow you to do undo the action for a few seconds if it was a mistake",
        "imageUrl": "tutorials/en/qn/delete/1.png"
      },
      {
        "message": "For Android 7.1 and above, any pinned quick notification (such as the one shown in the image) will not be deleted automatically since they are handled by the operating system and have to be deleted manually.",
        "imageUrl": "tutorials/en/qn/delete/2.png"
      }
    ]
  },
  {
  "title": "Using Custom Themes",
  "pageList": [
    {
      "message": "To get to the feature, go to the Settings tab and choose \"Configure Custom Theme\"",
      "imageUrl": "tutorials/en/customtheme/0.png"
    },
    {
      "message": "Custom Themes are a paid feature, so take a look around first. If you decide to purchase the functionality, tap the \"Purchase Custom Theme Support\" button.",
      "imageUrl": "tutorials/en/customtheme/1.png"
    },
    {
      "message": "After purchasing, you can change colors of screen elements. To find out more info about any item, long press the color name in the left hand column.",
      "imageUrl": "tutorials/en/customtheme/2.png"
    },
    {
      "message": "When you decide to change a color, tap the circle that you want to change. A color picker dialog will appear to let you select a color.",
      "imageUrl": "tutorials/en/customtheme/3.png"
    },
    {
      "message": "Once you have finished updating the theme, select it from the Spinner at the bottom of the page. Custom Light and Dark are the themes with your custom colors.",
      "imageUrl": "tutorials/en/customtheme/4.png"
    },
    {
      "message": "Finally, tap the \"Save & Apply\" button.",
      "imageUrl": "tutorials/en/customtheme/5.png"
    },
    {
      "message": "Your custom theme will be applied at this point! Have fun creating new themes!",
      "imageUrl": "tutorials/en/customtheme/6.png"
    },
    {
      "message": "For a video tutorial, please see the following YouTube video: https://youtu.be/09d8SvaCs_0",
      "imageUrl": "tutorials/en/customtheme/6.png"
    }
  ]
}
]